{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_2:0": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "105"}, {"size": "105"}, {"size": "3"}]}}, "input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "105"}, {"size": "105"}, {"size": "3"}]}}}, "outputs": {"dense_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9216"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9216"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9216"}, {"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/Conv2D_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/BiasAdd_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/Conv2D_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/BiasAdd_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/Conv2D_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/BiasAdd_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/Conv2D_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/BiasAdd_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/flatten/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm_1/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9216"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm_1/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9216"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/MatMul_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9216"}, {"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/BiasAdd_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/distance/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/distance/Maximum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/distance/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "105"}, {"size": "105"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3_1/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "105"}, {"size": "105"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3_1/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3_1/Mul", "op": "Mul", "input": ["input_2", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3_1/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3/Mul", "op": "Mul", "input": ["input_1", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3_1", "op": "Add", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3_1/Mul", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3_1/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3/Mul", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3_1", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/Conv2D_1/ReadVariableOp", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/BiasAdd_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/max_pooling2d/MaxPool_1", "op": "MaxPool", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/Relu_1"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/max_pooling2d/MaxPool_1", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/Conv2D_1/ReadVariableOp", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/BiasAdd_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/max_pooling2d/MaxPool", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/max_pooling2d_1/MaxPool_1", "op": "MaxPool", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/Relu_1"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/max_pooling2d_1/MaxPool_1", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/Conv2D_1/ReadVariableOp", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/BiasAdd_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/max_pooling2d_2/MaxPool_1", "op": "MaxPool", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/Relu_1"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/Relu"], "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/max_pooling2d_2/MaxPool_1", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/Conv2D_1/ReadVariableOp", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/BiasAdd_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/flatten/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/Relu_1", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/flatten/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/Relu", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/flatten/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/flatten/Reshape_1", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/flatten/Reshape", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm_1/mul_1", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm/mul_1", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/BiasAdd_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm_1/add_1", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/MatMul_1/ReadVariableOp", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/BiasAdd_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm/add_1", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/distance/sub", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/Sigmoid", "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/Sigmoid_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/distance/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/distance/sub", "StatefulPartitionedCall/SiameseNeuralNetwork/distance/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/distance/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/distance/Sum", "StatefulPartitionedCall/SiameseNeuralNetwork/distance/Maximum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/distance/Maximum_1", "op": "Maximum", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/distance/Maximum", "StatefulPartitionedCall/SiameseNeuralNetwork/distance/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/distance/Sqrt", "op": "Sqrt", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/distance/Maximum_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/distance/Sqrt", "StatefulPartitionedCall/SiameseNeuralNetwork/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/SiameseNeuralNetwork/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/dense_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/SiameseNeuralNetwork/dense_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of75.bin", "group1-shard2of75.bin", "group1-shard3of75.bin", "group1-shard4of75.bin", "group1-shard5of75.bin", "group1-shard6of75.bin", "group1-shard7of75.bin", "group1-shard8of75.bin", "group1-shard9of75.bin", "group1-shard10of75.bin", "group1-shard11of75.bin", "group1-shard12of75.bin", "group1-shard13of75.bin", "group1-shard14of75.bin", "group1-shard15of75.bin", "group1-shard16of75.bin", "group1-shard17of75.bin", "group1-shard18of75.bin", "group1-shard19of75.bin", "group1-shard20of75.bin", "group1-shard21of75.bin", "group1-shard22of75.bin", "group1-shard23of75.bin", "group1-shard24of75.bin", "group1-shard25of75.bin", "group1-shard26of75.bin", "group1-shard27of75.bin", "group1-shard28of75.bin", "group1-shard29of75.bin", "group1-shard30of75.bin", "group1-shard31of75.bin", "group1-shard32of75.bin", "group1-shard33of75.bin", "group1-shard34of75.bin", "group1-shard35of75.bin", "group1-shard36of75.bin", "group1-shard37of75.bin", "group1-shard38of75.bin", "group1-shard39of75.bin", "group1-shard40of75.bin", "group1-shard41of75.bin", "group1-shard42of75.bin", "group1-shard43of75.bin", "group1-shard44of75.bin", "group1-shard45of75.bin", "group1-shard46of75.bin", "group1-shard47of75.bin", "group1-shard48of75.bin", "group1-shard49of75.bin", "group1-shard50of75.bin", "group1-shard51of75.bin", "group1-shard52of75.bin", "group1-shard53of75.bin", "group1-shard54of75.bin", "group1-shard55of75.bin", "group1-shard56of75.bin", "group1-shard57of75.bin", "group1-shard58of75.bin", "group1-shard59of75.bin", "group1-shard60of75.bin", "group1-shard61of75.bin", "group1-shard62of75.bin", "group1-shard63of75.bin", "group1-shard64of75.bin", "group1-shard65of75.bin", "group1-shard66of75.bin", "group1-shard67of75.bin", "group1-shard68of75.bin", "group1-shard69of75.bin", "group1-shard70of75.bin", "group1-shard71of75.bin", "group1-shard72of75.bin", "group1-shard73of75.bin", "group1-shard74of75.bin", "group1-shard75of75.bin"], "weights": [{"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/Conv2D/ReadVariableOp", "shape": [10, 10, 3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/Conv2D/ReadVariableOp", "shape": [7, 7, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/Conv2D/ReadVariableOp", "shape": [4, 4, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/Conv2D/ReadVariableOp", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm/mul", "shape": [9216], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm/sub", "shape": [9216], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/MatMul/ReadVariableOp", "shape": [9216, 4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/BiasAdd/ReadVariableOp", "shape": [4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/Conv2D_1/ReadVariableOp", "shape": [10, 10, 3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d/BiasAdd_1/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/Conv2D_1/ReadVariableOp", "shape": [7, 7, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_1/BiasAdd_1/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/Conv2D_1/ReadVariableOp", "shape": [4, 4, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_2/BiasAdd_1/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/Conv2D_1/ReadVariableOp", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/conv2d_3/BiasAdd_1/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/flatten/Const_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm_1/mul", "shape": [9216], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization_1/batchnorm_1/sub", "shape": [9216], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/MatMul_1/ReadVariableOp", "shape": [9216, 4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/dense/BiasAdd_1/ReadVariableOp", "shape": [4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/distance/Sum/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/distance/Maximum/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/distance/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/dense_1/MatMul/ReadVariableOp", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/dense_1/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3/Offset", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3_1/Scaled", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3_1/Offset", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SiameseNeuralNetwork/embedding/batch_normalization/FusedBatchNormV3/Scaled", "shape": [3], "dtype": "float32"}]}]}